---
kind: type
id: T:Autodesk.Revit.DB.FitDirectionType
source: html/dabf58ad-84fd-b75a-653b-284467bb2d05.htm
---
# Autodesk.Revit.DB.FitDirectionType

This enum is used to define the direction to fit the number of pixels defined by PixelSize.

## Syntax (C#)
```csharp
public enum FitDirectionType
```